## pandas 3

In [3]:
import pandas as pd

In [37]:
## reindex()

In [ ]:
pandas reindex function create a new index nan value untill we are 
not passing the logic for filling the value

In [7]:


# Create a dataset
data = {
    "courses": ["Python", "Data Science", "Machine Learning", "Web Development"],
    "fee": [5000, 10000, 12000, 8000],
    "duration": ["3 months", "6 months", "4 months", "5 months"],
    "discount": [10, 15, 20, 10]
}

# Convert the dataset into a DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
print(df)

            courses    fee  duration  discount
0            Python   5000  3 months        10
1      Data Science  10000  6 months        15
2  Machine Learning  12000  4 months        20
3   Web Development   8000  5 months        10

In [8]:
df2=df.reindex(["r1",1,"r3","r4"])

In [9]:
df2

         courses      fee  duration  discount
r1           NaN      NaN       NaN       NaN
1   Data Science  10000.0  6 months      15.0
r3           NaN      NaN       NaN       NaN
r4           NaN      NaN       NaN       NaN

In [10]:
df2=df.reindex(["r1",1,"r3","r4"],fill_value="teasting")

In [11]:
df2

         courses       fee  duration  discount
r1      teasting  teasting  teasting  teasting
1   Data Science     10000  6 months        15
r3      teasting  teasting  teasting  teasting
r4      teasting  teasting  teasting  teasting

In [13]:
df

            courses    fee  duration  discount
0            Python   5000  3 months        10
1      Data Science  10000  6 months        15
2  Machine Learning  12000  4 months        20
3   Web Development   8000  5 months        10

## slice the data from the dataframe
## loc(location)
## iloc(int location)

In [15]:
df2=np.ramdon.randn(8,4)

NameError: name 'np' is not defined

In [16]:
import numpy as np

In [17]:
df2=np.random.randn(8,4)

In [18]:
df2=pd.DataFrame(np.random.randn(8,4),index=["a","b","c","d","e","f","g","h"],columns=["A","B","C","D"])

In [19]:
df2

          A         B         C         D
a -1.406516 -0.518071  0.020970 -0.108598
b  1.117979  1.660556 -0.405748  0.215044
c -0.289073 -0.747950  0.083213 -0.699778
d -0.257283 -0.132770  0.211288 -1.436809
e  0.016966 -0.847879 -0.385437  1.047889
f -0.990282  1.357602  0.762508  2.307366
g  0.065573 -0.387978  1.127632  0.227206
h -0.192528  0.570026 -0.111038  0.499376

In [38]:
## df2.loc[row,cols]

In [21]:
df2.loc[:,["A","B"]]

          A         B
a -1.406516 -0.518071
b  1.117979  1.660556
c -0.289073 -0.747950
d -0.257283 -0.132770
e  0.016966 -0.847879
f -0.990282  1.357602
g  0.065573 -0.387978
h -0.192528  0.570026

In [22]:
df2.loc[["a","b","g","h"],['A','B']]

          A         B
a -1.406516 -0.518071
b  1.117979  1.660556
g  0.065573 -0.387978
h -0.192528  0.570026

In [23]:
df2.loc['a']>0

A    False
B    False
C     True
D    False
Name: a, dtype: bool

## iloc-->> integer location

In [27]:
df2

          A         B         C         D
a -1.406516 -0.518071  0.020970 -0.108598
b  1.117979  1.660556 -0.405748  0.215044
c -0.289073 -0.747950  0.083213 -0.699778
d -0.257283 -0.132770  0.211288 -1.436809
e  0.016966 -0.847879 -0.385437  1.047889
f -0.990282  1.357602  0.762508  2.307366
g  0.065573 -0.387978  1.127632  0.227206
h -0.192528  0.570026 -0.111038  0.499376

In [29]:
df2.loc['a','C']

0.02097024847872197

In [30]:
df2.iloc[0,3]

-0.10859751168633011

In [33]:
df2.iloc[:4]

          A         B         C         D
a -1.406516 -0.518071  0.020970 -0.108598
b  1.117979  1.660556 -0.405748  0.215044
c -0.289073 -0.747950  0.083213 -0.699778
d -0.257283 -0.132770  0.211288 -1.436809

In [35]:
df2.iloc[1:5,2:4] # n-1

          C         D
b -0.405748  0.215044
c  0.083213 -0.699778
d  0.211288 -1.436809
e -0.385437  1.047889

In [36]:
df2.iloc[:,1:3]

          B         C
a -0.518071  0.020970
b  1.660556 -0.405748
c -0.747950  0.083213
d -0.132770  0.211288
e -0.847879 -0.385437
f  1.357602  0.762508
g -0.387978  1.127632
h  0.570026 -0.111038